---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFile.Dispose
source: html/08ef72c0-5486-32b0-e8e5-7fdc1d12c5de.htm
---
# Autodesk.Revit.DB.FabricationItemFile.Dispose Method

Releases all resources used by the FabricationItemFile

## Syntax (C#)
```csharp
public void Dispose()
```